Theratree/app/controllers/therapists_controller.rb

  def index
    @therapists = Therapist.all
---
SELECT "therapists".* FROM "therapists"

  def search
    @search_therapists = getCategoriesAndTherapists(params[:query]).last
    @therapists = Therapist.all
---
SELECT "therapists".* FROM "therapists"

    def set_therapist
      @therapist = Therapist.find(params[:id])
---
SELECT  "therapists".* FROM "therapists" WHERE "therapists"."therapist_id" = ? LIMIT 1  [["therapist_id", 1]]