Theratree/app/views/therapists/show.html.erb

SELECT "th_locations".* FROM "th_locations" WHERE "th_locations"."therapist_id" = ?  [["therapist_id", 1]]
---
        <li class="nav-header">Location</li>
        <% @therapist.th_location.each do |l| %>

SELECT  1 AS one FROM "th_specialties" WHERE "th_specialties"."therapist_id" = ? LIMIT 1  [["therapist_id", 1]]
SELECT "th_specialties".* FROM "th_specialties" WHERE "th_specialties"."therapist_id" = ?  [["therapist_id", 1]]
---
          <ul class="therapist-list">
          <% if @therapist.th_specialty.empty? %>

SELECT  1 AS one FROM "th_treatment_orientations" WHERE "th_treatment_orientations"."therapist_id" = ? LIMIT 1  [["therapist_id", 3]]
SELECT "th_treatment_orientations".* FROM "th_treatment_orientations" WHERE "th_treatment_orientations"."therapist_id" = ?  [["therapist_id", 1]]
---
          <ul class="therapist-list">
            <% if @therapist.th_treatment_orientation.empty? %>

SELECT  1 AS one FROM "th_modalities" WHERE "th_modalities"."therapist_id" = ? LIMIT 1  [["therapist_id", 3]]
SELECT "th_modalities".* FROM "th_modalities" WHERE "th_modalities"."therapist_id" = ?  [["therapist_id", 1]]
---
            <% end %>
            <% if @therapist.th_modality.empty? %>

SELECT  1 AS one FROM "th_insurances" WHERE "th_insurances"."therapist_id" = ? LIMIT 1  [["therapist_id", 4]]
SELECT "th_insurances".* FROM "th_insurances" WHERE "th_insurances"."therapist_id" = ?  [["therapist_id", 1]]
---
          <ul class="therapist-list">
            <% if @therapist.th_insurance.empty? %>